sample_app/app/controllers/static_pages_controller.rb

  def home
  	if signed_in?
  		@micropost 	= current_user.microposts.build if signed_in?
  		@feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT "microposts".* FROM "microposts" WHERE (user_id = 1) ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]